
admin_qq = ['1018642458']

# 过滤不需要的内容
ban_msgs = ['微博官方唯一抽奖工具', '激励计划', '中奖']

weibo_config = [
    {
        "tag": "東山風",
        "containerId": "1076033830410923",
        "groups": ['527335380']
    },
    {
        "tag": "崩坏星穹铁道",
        "containerId": "1076037643376782",
        "groups": ['527335380', '922293460']
    },
    # {
    #     "tag": "泛式",
    #     "containerId": "1076032204454944",
    #     "groups": ['527335380']
    # },
    # {
    #     "tag": "瓶子君152",
    #     "containerId": "1076032254113633",
    #     "groups": ['527335380']
    # },
    {
        "tag": "黑神话之悟空",
        "containerId": "1076037483050868",
        "groups": ['527335380', '764468332']
    },
    {
        "tag": "无限暖暖",
        "containerId": "1076037801655101",
        "groups": ['527335380', '764468332']
    },
    {
        "tag": "游戏动力",
        "containerId": "1076035762457113",
        "effectMsgs": ['游戏', '实机', 'DLC', 'Steam', 'PC', 'Switch', '任天堂', 'Xbox', 'XBOX', '微软', 'PlayStation',
                       'PS3', 'PS4', 'PS5', '索尼', 'Epic', 'iOS', 'Android', '手游', '内测', '公测', '预售', '发售', '打折',
                       '折扣', '销量', 'TGA'],
        "groups": ['527335380', '764468332']
    },
]
